import asyncio
from aiogram import Bot, Dispatcher, F
from aiogram.types import Message, FSInputFile, ReplyKeyboardMarkup, KeyboardButton, ReplyKeyboardRemove
from aiogram.filters import CommandStart, Command
from aiogram.enums import ParseMode
from aiogram.fsm.state import State, StatesGroup
from aiogram.fsm.storage.memory import MemoryStorage
from aiogram.fsm.context import FSMContext
import datetime
import re
import but




# Ініціалізація бота
bot = Bot(token='8031989999:AAGu7uJeZkTjJyzVnEjLoNphRfGvzQjoC3c')
dp = Dispatcher(storage=MemoryStorage())  # Обов’язково додати storage

# ID адміна
ADMIN_CHAT_ID = 7131545198

# Стани анкети
class RecruitingForm(StatesGroup):
    PIB = State()
    birth = State()
    phone = State()
    city = State()
    posada = State()
    komentar = State()


@dp.message(CommandStart())
async def cmd_start(message: Message):
    await message.answer("Вітаємо в боті для рекруту в бригаду Фенікс! Заповніть анкету та ознайомтеся з вакансіями.", reply_markup=but.main)

@dp.message(F.text == 'Інженер БпЛА')
async def inzhener_bpla(message: Message, state: FSMContext):
    await message.answer("""Нам потрібні фахівці, які вміють працювати з аналоговими та цифровими системами зв’язку, розуміються на БпЛА різних типів та здатні оперативно виявити й усунути несправність. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

підготовка безпілотників різних типів до польоту
обслуговування антен, їх трактів, фільтрів під різні частоти
обслуговування аналогових та цифрових систем зв’язку.

Вимоги:

профільна освіта за напрямком та/або досвід роботи в галузі
досвід роботи з БпЛА різних типів — перевага
навички електротехніка або слюсаря — перевага
бажано — наявність водійського посвідчення.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.""")



@dp.message(F.text == 'Оператор БпЛА')
async def tekhnik_bpla(message: Message, state: FSMContext):
    await message.answer("""Нам потрібні оператори ударних FPV-дронів, нічних бомберів “Vampire”, “Мавіків” та дронів типу “крило”. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

пілотування конкретного типу БпЛА
орієнтування на місцевості
виявлення та ураження ворожих об’єктів
підготовка та супровід БпЛА до та під час польоту

Вимоги:

вміння керувати БпЛА конкретного типу;
здатність чітко виконувати бойові завдання;
бажання вчитися та самовдосконалюватися;
перевага — досвідченим пілотам.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.""")

@dp.message(F.text == 'Технік БпЛА')
async def tekhnik_bpla(message: Message, state: FSMContext):
    await message.answer("""Нам потрібні спеціалісти-техніки, які будуть безпосередньо готувати безпілотники різних типів до виконання бойових завдань, обслуговувати їх, доглядати за технічним станом БпЛА. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

підготовка БпЛА різних типів до бойової роботи
обслуговування безпілотників
забезпечення перебування БпЛА у справному стані
вміння швидко та своєчасно виявляти й усувати несправності

Вимоги:

технічна освіта
досвід роботи з технікою (робота з БпЛА — перевага)
електротехнічні навички — перевага
бажано — наявність водійського посвідчення.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.""")




@dp.message(F.text == 'Водій екіпажу БпЛА')
async def ekipazh_bpla(message: Message, state: FSMContext):
    await message.answer("""Нам потрібні досвідчені водії, здатні маневрувати на важкопрохідних ділянках та орієнтуватися на бездоріжжі. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

керування транспортними засобами, перевезення вантажів
перевезення особового складу на та з позицій
догляд за технічним станом транспортного засобу
заправлення транспортного засобу пальним.

Вимоги:

наявність водійського посвідчення (категорії С, D, перевага — наявність категорії Е)
досвід керування транспортними засобами від 2 років
вміння орієнтуватися на бездоріжжі
дисциплінованість, відповідальність

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.
""")

@dp.message(F.text == 'Інженер-сапер БпЛА')
async def saper_bpla(message: Message, state: FSMContext):
    await message.answer("""Нам потрібні фахівці, які вміють поводитися з боєприпасами, удосконалювати їх та безпечно кріпити до безпілотників різних типів. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

робота з різними боєприпасами: підготовка до використання, удосконалення, кріплення до БпЛА;
дотримання усіх правил безпеки при роботі з боєприпасами.

Вимоги:

технічна освіта
гарна фізична форма
розуміння основ мінно-вибухової справи.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.""")

@dp.message(F.text == 'Бойовий медик')
async def boyovyy_medyk(message: Message, state: FSMContext):
    await message.answer("""Нам потрібні медичні працівники, які можуть своєчасно надати фахову медичну допомогу нашим бійцям. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

надання першої медичної допомоги військовослужбовцям, які захворіли або отримали поранення
участь в евакуації хворих або поранених військовослужбовців
супровід таких військових до медичного пункту підрозділу, стабілізаційного пункту, контроль за подальшими етапами їх лікування
проведення заходів із запобігання поширенню захворювань та травмувань у підрозділі
перевірка укомплектованості підрозділу необхідними медичними засобами.

Вимоги

наявність медичної освіти
пройдені спеціалізовані курси підготовки — перевага
досвід роботи бойовим медиком — перевага.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.""")

@dp.message(F.text == 'Оператор РЕБ/РЕР')
async def operator_reb(message: Message, state: FSMContext):
    await message.answer("""Нам необхідні фахівці, які вміють вчасно виявляти ворожі БпЛА та ефективно їм протидіяти. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

робота з комп’ютерною технікою
збір та обробка інформації, формування звітів
робота з документацією
комунікація з підрозділами.

Вимоги:

вміння користуватися комп’ютером
уважність, відповідальність
здатність та бажання навчатися
відсутність шкідливих звичок.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.""")

@dp.message(F.text == 'Майстер-вибухотехник Бпла')
async def vybuhotekhnik(message: Message, state: FSMContext):
    await message.answer("""Нам необхідні справжні майстри своєї справи, які зможуть виготовити або удосконалити будь-який боєприпас. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

пайка простих електричних схем
виконання слюсарних робіт
виконання вантажних робіт
виконання додаткових супутніх завдань.

Вимоги:

наявність технічної освіти
досвід роботи на виробництві — перевага
вміння професійно працювати з електричними та ручними інструментами.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування
""")

@dp.message(F.text == 'Майстер з ремонту БпЛА')
async def remont_bpla(message: Message, state: FSMContext):
    await message.answer("""Нам потрібні фахівці, які зможуть вчасно удосконалити або полагодити будь-який дрон. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

модернізація БпЛА різних типів
ремонт БпЛА різних типів

Вимоги:

досвід роботи з паяльником
вміння читати електросхеми
технічна освіта — перевага
Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.""")

@dp.message(F.text == 'Діловод')
async def dilovod(message: Message, state: FSMContext):
    await message.answer("""Нам потрібні дисципліновані фахівці, які вміють чітко, своєчасно та грамотно вести документацію й вести ділову кореспонденцію. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

ведення книги особового складу та іншої документації щодо особового складу
оформлення різних довідок для особового складу
подання до нагород особового складу
оформлення рапортів на премії, стягнення та заохочення
подання рапортів на зарплати та премії
оформлення документації з переміщення особового складу по посадах
ведення бойового чисельного складу підрозділу
оформлення посвідчень учасника бойових дій для особового складу
оформлення листів-запитів, актів прийому-передачі майна, що заходить у підрозділ, списання майна, ведення таблиць з наявного майна

Вимоги:

уважність до деталей
відповідальність
грамотність
вміння працювати з великими обсягами документів;
досвід роботи у військовому діловодстві — перевага.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.""")

@dp.message(F.text == 'Відеооператор-режисер монтажу')
async def videooperator(message: Message, state: FSMContext):
    await message.answer("""Нам потрібні досвідчені та креативні контент-мейкерки, які здатні цікаво та яскраво висвітлювати роботу пілотів БпЛА підрозділу “Фенікс”. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

організація та проведення зйомок
генерування креативних ідей для відео
монтаж відзнятих відео, а також матеріалів відпрацювань підрозділу
підготовка відео для різних соціальних мереж;
робота з архівом відео (збереження відеоматеріалів, їх систематизація, використання в подальшій роботі)

Вимоги:

досвід роботи відеооператором та/або режисером монтажу
вміння працювати з різними монтажними середовищами
вміння працювати з корекцією кольору та звуку
розуміння технології виробництва відео різного рівня складності
вміння працювати з технікою для зйомок відео.
Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.""")

@dp.message(F.text == 'Черговий пункту управління')
async def chergovyy_punkt(message: Message, state: FSMContext):
    await message.answer("""Нам необхідні люди, які зможуть фахово налагодити комунікацію між командуванням та пілотами БпЛА, оперативно вести логування та контролювати виконання бойових завдань особовим складом. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

забезпечення функціонування пункту управління
контроль за виконанням бойових завдань
логування та здійснення доповідей щодо подій та надзвичайних ситуацій
створення підсумкових звітів та візуалізацій
вибудовування процесів збору та обробки інформації
комунікація з командуванням та особовим складом
розробка та ведення бойової й звітної документації
нанесення обстановки та цілей на цифрові та паперові мапи.

Вимоги:

здатність сприймати та обробляти великі обсяги інформації
комунікабельність
уважність до деталей
відповідальність
вміння працювати з електронними таблицями
володіння комп’ютером
знання топографії, розуміння географічних координат
досвід у військовому діловодстві — перевага
наявність водійського посвідчення категорії В — перевага.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.""")

@dp.message(F.text == 'Інструктор БпЛА')
async def instruktor_bpla(message: Message, state: FSMContext):
    await message.answer("""Ми потребуємо фахових пілотів БпЛА, які мають хист до навчання й зможуть поділитися своїм досвідом і знаннями з колегами. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

навчання військовослужбовців пілотуванню різних типів БпЛА
злагодження екіпажів БпЛА
підготовка навчальних матеріалів, планування місій та маршрутів навчальних польотів
контроль за тренувальними польотами
ведення звітності за результатами навчань
оцінка знань та навичок екіпажів.

Вимоги:


досвід керування безпілотниками різних типів у бойових умовах
досвід польотів в умовах роботи ворожих засобів РЕБ
навички в налаштуваннях дронів, підготовці їх до польотів, дрібному ремонті
вміння правильно й доступно донести інформацію до колег
сертифікат інструктора — перевага
водійське посвідчення категорії В — перевага
Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.""")

@dp.message(F.text == "Зв'язківець (ІТ-напрямок)")
async def zv_it(message: Message, state: FSMContext):
    await message.answer("""Нам потрібні фахівці, здатні забезпечити постійний та безперебійний зв’язок для комунікації. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

розв'язання проблем, пов’язаних зі зв’язком між програмним забезпеченням та обладнанням
ведення документації та звітності
налаштування та контроль за справністю мережевого обладнання
забезпечення оптимальної функціональності та надійності мереж

Вимоги:

досвід роботи системним адміністратором та/або в галузі інтернет-мереж
розуміння на мережевих технологіях
ІТ-освіта — перевага.
Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.""")

@dp.message(F.text == "Зв'язківець (Радіозв'язок)")
async def zv_radio(message: Message, state: FSMContext):
    await message.answer("""Нам потрібні фахівці, здатні забезпечити постійний та безперебійний зв’язок для комунікації. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

допомога в розробці та реалізації стратегії забезпечення радіозв’язку
робота з забезпечення функціонування надійного радіозв’язку
підтримка та управління засобами радіозв’язку
забезпечення ефективного функціонування систем радіозв’язку.

Вимоги:

досвід роботи з радіотехнікою
розуміння технології радіозв’язку
освіта за спеціальністю “Електроніка та радіотехніка” — перевага.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.""")

@dp.message(F.text == 'Військовий психолог')
async def psykholoh(message: Message, state: FSMContext):
    await message.answer("""Нам потрібні фахові спеціалісти, які зможуть тримати дух особового складу на високому рівні, допомагати військовослужбовцям у кризових ситуаціях, слідкувати за здоровою атмосферою у військовому колективі. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

психопрофілактична робота з особовим складом
психодіагностика
проведення психологічних консультацій та психокорекції з військовослужбовцями та членами їх родин
психологічна підтримка та допомога військовослужбовцям підрозділу.

Вимоги:

наявність освіти психолога
досвід роботи за фахом
володіння знаннями та практичними навичками в галузі
особиста психологічна стійкість.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.""")

@dp.message(F.text == 'Поліграфолог')
async def polihrafolog(message: Message, state: FSMContext):
    await message.answer("""Нам потрібні експерти, здатні правильно проводити співбесіди, з аналітичним складом розуму та уважністю до деталей — для фахового добору військовослужбовців та подальшої роботи з ними. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

проведення психологічного тестування
проведення службових розслідувань
аналіз вхідних даних
дотримання нормативних вимог
надання звітності та висновків за результатами тестувань.

Вимоги:

вік від 25 років
вища освіта за напрямками “Психологія” та/або “Правоохоронна діяльність”
досвід роботи в форматі “людина-людина”
досвід оперативної роботи в правоохоронних органах — перевага
комунікабельність
здібності до аналізу
стресостійкість
відповідальність
уважність до деталей.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення засобами індивідуального захисту та військовим майном
зарплатня від 100 тисяч гривень
навчання, постійні тренування
щорічна відпустка згідно з чинним законодавством України.""")

@dp.message(F.text == 'SMM-менеджер')
async def smm_manager(message: Message, state: FSMContext):
    await message.answer("""Нам потрібні люди, які вміють вдало підбирати контент для різних соціальних мереж, розуміються на їх специфіці й можуть вдало просувати інформацію про підрозділ у мережі. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

ведення соціальних мереж підрозділу (YouTube, Facebook, Telegram, TikTok, Instagram тощо)
моніторинг соціальних мереж
виготовлення та/або адаптація контенту під конкретну соціальну мережу
архівація та збереження контенту
створення та ведення звітності.

Вимоги:

досвід роботи в SMM
навички створення та/або адаптації контенту під різні соціальні мережі
дотримання дедлайнів
володіння Adobe Photoshop, Adobe Illustrator, Adobe Premier Pro, Da Vinci Resolve, Corel Draw — перевага
вміння працювати з Google-Таблиці та Google-Документи — перевага

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом;
повне забезпечення усім необхідним;
зарплатня від 100 тисяч гривень;
навчання, постійні тренування.""")

@dp.message(F.text == 'Фінансист')
async def finansyst(message: Message, state: FSMContext):
    await message.answer("""Нам потрібні люди, які розуміються в галузі бухгалтерського обліку та мають досвід роботи з фінансами. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

розрахунок грошового забезпечення, компенсацій, організація виплат військовослужбовцям
ведення фінансового обліку
формування фінансових розрахунків
подання заявок на кошти та оптимізацію їхнього використання
подання фінансових звітів
організація та контроль за обліком матеріально-технічних цінностей, участь у проведенні інвентаризації
проведення внутрішніх перевірок
ведення обліку документів.

Вимоги:

вища освіта в галузі “Облік та аудит”, “Фінанси” (або суміжні спеціальності)
знання всіх напрямків бухгалтерського обліку (господарські операції, кошти, взаєморахунки)
знання процедур внутрішнього контролю для забезпечення точності та надійності фінансової інформації
навички роботи з системами електронного документообігу та архівації документів
впевнене володіння Excel для аналізу даних, складання звітів та бюджетування
знання нормативно-правової бази (податкове законодавство, бухгалтерський облік)
досвід роботи бухгалтером — перевага

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення всім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.""")

@dp.message(F.text == 'Фахівець з публічних закупівель')
async def zakupivli(message: Message, state: FSMContext):
    await message.answer("""Нам потрібні фахівці, здатні здійснювати необхідні для підрозділу закупівлі відповідно до норм чинного законодавства.Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

формування річного плану закупівель в електронній системі закупівель
вибір процедури закупівлі згідно з чинним законодавством
проведення закупівель з дотриманням чинного законодавства
складання, затвердження та зберігання закупівельної документації
оприлюднення відповідної інформації в електронній системі закупівель
взаємодія з органами, які здійснюють контроль в галузі публічних та оборонних закупівель
здійснення оборонних закупівель товарів, послуг та робіт.

Вимоги:

знання в галузі публічних та оборонних закупівель
вміння працювати в команді
здатність сприймати та обробляти великі обсяги інформації
вільне володіння комп’ютером
досвід роботи в галузі закупівель — перевага
освіта в галузі економіки або юриспруденції — перевага

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення всім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.""")

@dp.message(F.text == 'Графічний дизайнер')
async def dyzayner(message: Message, state: FSMContext):
    await message.answer("""Нам потрібні професіонали, здатні на основі брендбуку підрозділу розробляти графічну продукцію — як онлайн-графіку, так й макети для зовнішньої реклами. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем “Фенікс”. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

створення шаблонів, обкладинок, графічних звітів, презентацій
створення графічних матеріалів для соціальних мереж
створення графічних рішень для зовнішньої реклами підрозділу
робота з фотоматеріалами підрозділу
вміння працювати з фотоапаратурою — перевага
робота з брендбуком підрозділу.

Вимоги:

досвід роботи графічним дизайнером
знання основ композиції, макетування, дизайну
володіння відповідним програмним забезпеченням (Adobe Photoshop, Adobe Illustrator, Corel Draw тощо)
вміння знаходити та реалізовувати творчі ідеї
дотримання дедлайнів.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення засобами індивідуального захисту та військовим майном
зарплатня від 100 тисяч гривень
навчання, постійні тренування
щорічна відпустка згідно з чинним законодавством України.""")

@dp.message(F.text == 'Відправити анкету')
async def cmd_anketa(message: Message, state: FSMContext):
    await message.answer("""📑 Анкета

Надайте відповідь на наступні запитання 👇""", reply_markup=but.main())
    await message.answer("Прізвище ім'я по-батькові")
    await state.set_state(RecruitingForm.PIB)


@dp.message(F.text == 'Назад')
async def cmd_back(message: Message):
    await message.answer("Назад",reply_markup=but.main)

@dp.message(RecruitingForm.PIB)
async def cmd_pib(message: Message, state: FSMContext):
    await state.update_data(PIB=message.text)
    await message.answer("""🗓 Дата народження

ℹ️ у форматі дд-мм-рррр


ЗВЕРНІТЬ УВАГУ!!! 
Вам має бути 18+ років щоб далі заповнити анкету
Приклад: 12-12-2000""", reply_markup=but.main)
    await state.set_state(RecruitingForm.birth)
def is_valid_birthdate(date_text: str) -> bool:
    try:
        birth_date = datetime.datetime.strptime(date_text, "%d-%m-%Y")
        today = datetime.datetime.today()
        age = (today - birth_date).days // 365
        return age >= 18
    except ValueError:
        return False

@dp.message(RecruitingForm.birth)
async def cmd_birth(message: Message, state: FSMContext):
    if not is_valid_birthdate(message.text):
        await message.answer("""Введіть правильну дату народження за форматом 12-12-2000
        Вам має бути більше 18 років щоб продовжити""")

        return

    await state.update_data(birth=message.text)
    kb = ReplyKeyboardMarkup(
        keyboard=[[KeyboardButton(text="📲 Поділитися контактом", request_contact=True)]],
        resize_keyboard=True,
        one_time_keyboard=True
    )
    await message.answer(
        """📱 Номер телефону

ℹ️ натисніть кнопку нижче, щоб поділитися номером телефону, або введіть його у міжнародному форматі +380ХХХХХХХХХ 👇""",
        reply_markup=kb
    )
    await state.set_state(RecruitingForm.phone)
def is_valid_phone(phone: str) -> bool:
    return re.match(r'^\+?\d{10,15}$', phone)

@dp.message(RecruitingForm.phone)
async def cmd_phone(message: Message, state: FSMContext):
    # Перевірка: контакт або текст
    if not is_valid_phone(message.text):
        await message.answer("Увведений некорректний номер телефону. Спробуйте ще раз ")
        return  
    phone_number = message.contact.phone_number if message.contact else message.text
    await state.update_data(phone=phone_number)
    await message.answer("🗺 Місто фактичного перебування\n\nℹ️ назва населеного пункта", reply_markup=ReplyKeyboardRemove())
    await state.set_state(RecruitingForm.city)


@dp.message(RecruitingForm.city)
async def cmd_city(message: Message, state: FSMContext):
    await state.update_data(city=message.text)

    kb = ReplyKeyboardMarkup(
        keyboard=[

        ]
    )

    await message.answer("""📋 Бажана посада

ℹ️ оберіть за допомогою кнопок 👇""", reply_markup=but.main)
    await state.set_state(RecruitingForm.posada)


@dp.message(RecruitingForm.posada)
async def cmd_posada(message: Message, state: FSMContext):
    await state.update_data(posada=message.text)
    await message.answer("""💬 Коментар
    
ℹ️ напишіть коментар, якщо бажаєте, або поставте -""", reply_markup=ReplyKeyboardRemove())
    await state.set_state(RecruitingForm.komentar)







@dp.message(RecruitingForm.komentar)
async def cmd_komentar(message: Message, state: FSMContext):
    await state.update_data(komentar=message.text)
    await message.answer('Будь ласка віберіть посаду, яка вас цікавить ')

    data = await state.get_data()
    user_data_message = (
          f"📥 Нова анкета:\n\n"
          f"👤 Прізвище, ім'я, по-батькові: {data['PIB']}\n"
          f"🗓 Дата народження: {data['birth']}\n"
          f"📞 Номер телефону: {data['phone']}\n"
          f"🏙 Місто: {data['city']}\n"
          f"💼 Посада: {data['posada']}\n"
          f"💬 Коментар: {data['komentar']}\n"
    )

    await message.answer("✅ Дякуємо! Вашу анкету надіслано. Очікуйте на відповідь.", reply_markup=but.main)
    await bot.send_message(chat_id=ADMIN_CHAT_ID, text=user_data_message)
    await state.clear()


@dp.message(F.text == 'Слово комбрига')
async def cmd_kombrig(message: Message):
    await bot.send_photo(chat_id=message.chat.id, photo=FSInputFile('комбриг.png'))
    await message.answer("""Хочешь бути корисним для своєї країни? 
Готовий її захищати?
Згоден опановувати нові навички?
ПРИЄДНУЙСЯ ДО НАС!!!

Україна чекає на тебе

Командир бригади Дмитро Олексюк""")




# Запуск бота
async def main():
    await dp.start_polling(bot)

if __name__ == '__main__':
    try:
        asyncio.run(main())
    except KeyboardInterrupt:
        print('Бот виключений')