word = """Хочешь бути корисним для своєї країни? 
Готовий її захищати?
Згоден опановувати нові навички?
ПРИЄДНУЙСЯ ДО НАС!!!

Україна чекає на тебе

Командир полку Дмитро Олексюк
Подати анкету можна на сайті https://fxdpsu.com або у бот"""





bpla_inj = """Нам потрібні фахівці, які вміють працювати з аналоговими та цифровими системами зв’язку, розуміються на БпЛА різних типів та здатні оперативно виявити й усунути несправність. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем Phoenix. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

підготовка безпілотників різних типів до польоту
обслуговування антен, їх трактів, фільтрів під різні частоти
обслуговування аналогових та цифрових систем зв’язку.

Вимоги:

профільна освіта за напрямком та/або досвід роботи в галузі
досвід роботи з БпЛА різних типів — перевага
навички електротехніка або слюсаря — перевага
бажано — наявність водійського посвідчення.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування."""


operator_bpla = """Нам потрібні оператори ударних FPV-дронів, нічних бомберів “Vampire”, “Мавіків” та дронів типу “крило”. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

пілотування конкретного типу БпЛА
орієнтування на місцевості
виявлення та ураження ворожих об’єктів
підготовка та супровід БпЛА до та під час польоту

Вимоги:

вміння керувати БпЛА конкретного типу;
здатність чітко виконувати бойові завдання;
бажання вчитися та самовдосконалюватися;
перевага — досвідченим пілотам.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування"""



technik = """Нам потрібні спеціалісти-техніки, які будуть безпосередньо готувати безпілотники різних типів до виконання бойових завдань, обслуговувати їх, доглядати за технічним станом БпЛА. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

підготовка БпЛА різних типів до бойової роботи
обслуговування безпілотників
забезпечення перебування БпЛА у справному стані
вміння швидко та своєчасно виявляти й усувати несправності

Вимоги:

технічна освіта
досвід роботи з технікою (робота з БпЛА — перевага)
електротехнічні навички — перевага
бажано — наявність водійського посвідчення.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування."""



vodiy = """Нам потрібні досвідчені водії, здатні маневрувати на важкопрохідних ділянках та орієнтуватися на бездоріжжі. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

керування транспортними засобами, перевезення вантажів
перевезення особового складу на та з позицій
догляд за технічним станом транспортного засобу
заправлення транспортного засобу пальним.

Вимоги:

наявність водійського посвідчення (категорії С, D, перевага — наявність категорії Е)
досвід керування транспортними засобами від 2 років
вміння орієнтуватися на бездоріжжі
дисциплінованість, відповідальність

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.
"""



saper = """Нам потрібні фахівці, які вміють поводитися з боєприпасами, удосконалювати їх та безпечно кріпити до безпілотників різних типів. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

робота з різними боєприпасами: підготовка до використання, удосконалення, кріплення до БпЛА;
дотримання усіх правил безпеки при роботі з боєприпасами.

Вимоги:

технічна освіта
гарна фізична форма
розуміння основ мінно-вибухової справи.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування."""




medik = """Нам потрібні медичні працівники, які можуть своєчасно надати фахову медичну допомогу нашим бійцям. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

надання першої медичної допомоги військовослужбовцям, які захворіли або отримали поранення
участь в евакуації хворих або поранених військовослужбовців
супровід таких військових до медичного пункту підрозділу, стабілізаційного пункту, контроль за подальшими етапами їх лікування
проведення заходів із запобігання поширенню захворювань та травмувань у підрозділі
перевірка укомплектованості підрозділу необхідними медичними засобами.

Вимоги

наявність медичної освіти
пройдені спеціалізовані курси підготовки — перевага
досвід роботи бойовим медиком — перевага.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування."""


operator_reb = """Нам необхідні фахівці, які вміють вчасно виявляти ворожі БпЛА та ефективно їм протидіяти. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

робота з комп’ютерною технікою
збір та обробка інформації, формування звітів
робота з документацією
комунікація з підрозділами.

Вимоги:

вміння користуватися комп’ютером
уважність, відповідальність
здатність та бажання навчатися
відсутність шкідливих звичок.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування."""


babax_bpla = """Нам необхідні справжні майстри своєї справи, які зможуть виготовити або удосконалити будь-який боєприпас. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

пайка простих електричних схем
виконання слюсарних робіт
виконання вантажних робіт
виконання додаткових супутніх завдань.

Вимоги:

наявність технічної освіти
досвід роботи на виробництві — перевага
вміння професійно працювати з електричними та ручними інструментами.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування"""


fix_bpla = """Нам потрібні фахівці, які зможуть вчасно удосконалити або полагодити будь-який дрон. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

модернізація БпЛА різних типів
ремонт БпЛА різних типів

Вимоги:

досвід роботи з паяльником
вміння читати електросхеми
технічна освіта — перевага
Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування."""



dilovod = """Нам потрібні дисципліновані фахівці, які вміють чітко, своєчасно та грамотно вести документацію й вести ділову кореспонденцію. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

ведення книги особового складу та іншої документації щодо особового складу
оформлення різних довідок для особового складу
подання до нагород особового складу
оформлення рапортів на премії, стягнення та заохочення
подання рапортів на зарплати та премії
оформлення документації з переміщення особового складу по посадах
ведення бойового чисельного складу підрозділу
оформлення посвідчень учасника бойових дій для особового складу
оформлення листів-запитів, актів прийому-передачі майна, що заходить у підрозділ, списання майна, ведення таблиць з наявного майна

Вимоги:

уважність до деталей
відповідальність
грамотність
вміння працювати з великими обсягами документів;
досвід роботи у військовому діловодстві — перевага.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.
"""







video = """Нам потрібні досвідчені та креативні контент-мейкерки, які здатні цікаво та яскраво висвітлювати роботу пілотів БпЛА підрозділу FENIX. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

організація та проведення зйомок
генерування креативних ідей для відео
монтаж відзнятих відео, а також матеріалів відпрацювань підрозділу
підготовка відео для різних соціальних мереж;
робота з архівом відео (збереження відеоматеріалів, їх систематизація, використання в подальшій роботі)

Вимоги:

досвід роботи відеооператором та/або режисером монтажу
вміння працювати з різними монтажними середовищами
вміння працювати з корекцією кольору та звуку
розуміння технології виробництва відео різного рівня складності
вміння працювати з технікою для зйомок відео.
Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.
"""



cherg = """Нам необхідні люди, які зможуть фахово налагодити комунікацію між командуванням та пілотами БпЛА, оперативно вести логування та контролювати виконання бойових завдань особовим складом. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

забезпечення функціонування пункту управління
контроль за виконанням бойових завдань
логування та здійснення доповідей щодо подій та надзвичайних ситуацій
створення підсумкових звітів та візуалізацій
вибудовування процесів збору та обробки інформації
комунікація з командуванням та особовим складом
розробка та ведення бойової й звітної документації
нанесення обстановки та цілей на цифрові та паперові мапи.

Вимоги:

здатність сприймати та обробляти великі обсяги інформації
комунікабельність
уважність до деталей
відповідальність
вміння працювати з електронними таблицями
володіння комп’ютером
знання топографії, розуміння географічних координат
досвід у військовому діловодстві — перевага
наявність водійського посвідчення категорії В — перевага.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування.
"""

instruct_bpla = """Ми потребуємо фахових пілотів БпЛА, які мають хист до навчання й зможуть поділитися своїм досвідом і знаннями з колегами. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

навчання військовослужбовців пілотуванню різних типів БпЛА
злагодження екіпажів БпЛА
підготовка навчальних матеріалів, планування місій та маршрутів навчальних польотів
контроль за тренувальними польотами
ведення звітності за результатами навчань
оцінка знань та навичок екіпажів.

Вимоги:


досвід керування безпілотниками різних типів у бойових умовах
досвід польотів в умовах роботи ворожих засобів РЕБ
навички в налаштуваннях дронів, підготовці їх до польотів, дрібному ремонті
вміння правильно й доступно донести інформацію до колег
сертифікат інструктора — перевага
водійське посвідчення категорії В — перевага
Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування."""



it = """Нам потрібні фахівці, здатні забезпечити постійний та безперебійний зв’язок для комунікації. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

розв'язання проблем, пов’язаних зі зв’язком між програмним забезпеченням та обладнанням
ведення документації та звітності
налаштування та контроль за справністю мережевого обладнання
забезпечення оптимальної функціональності та надійності мереж

Вимоги:

досвід роботи системним адміністратором та/або в галузі інтернет-мереж
розуміння на мережевих технологіях
ІТ-освіта — перевага.
Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування."""



radio = """Нам потрібні фахівці, здатні забезпечити постійний та безперебійний зв’язок для комунікації. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

допомога в розробці та реалізації стратегії забезпечення радіозв’язку
робота з забезпечення функціонування надійного радіозв’язку
підтримка та управління засобами радіозв’язку
забезпечення ефективного функціонування систем радіозв’язку.

Вимоги:

досвід роботи з радіотехнікою
розуміння технології радіозв’язку
освіта за спеціальністю “Електроніка та радіотехніка” — перевага.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування."""



perevag = """Наші переваги 💪
🏕️ Власна база для підготовки пілотів БпЛА

📡 Використання найсучасніших засобів РЕБ

🔧 Постійне удосконалення БпЛА

🎯 Новітній підхід до знищення ворога

💰 Конкурентна заробітна плата

"""

link = """Наше демо відео 
            👇👇👇
https://youtu.be/MKJVR36TUlg"""

about = """<b>Прикордонний підрозділ FENIX — еталон мужності, інновацій та ефективності на фронті сучасної війни.</b>

FENIX — це перший у структурі Державної прикордонної служби України підрозділ, що спеціалізується на застосуванні безпілотних авіаційних систем. Завдяки злагодженій роботі операторів, аналітиків і технічних спеціалістів, FENIX став справжньою легендою серед сил оборони.

<b>За 2024 рік бійці підрозділу уразили понад 8 000 цілей, завдавши ворогу збитків на суму понад 60 мільйонів доларів США</b>. Це десятки знищених танків, бронетранспортерів, артилерійських установок, систем ППО та складів з боєприпасами. Їхня робота щодня рятує життя українських воїнів і наближає нашу Перемогу.

Ефективність та бойовий дух FENIX були високо оцінені керівництвом держави, внаслідок чого ухвалено рішення про масштабне розширення підрозділу.

<b>На чолі підрозділу стоїть Герой України — підполковник Дмитро Олексюк</b>, досвідчений офіцер і справжній лідер, який із першого дня війни показує приклад служіння державі та непохитної віри в нашу перемогу.

Підрозділ FENIX — це майбутнє сучасної оборони, яке вже сьогодні змінює хід війни."""

psycho = """Нам потрібні фахові спеціалісти, які зможуть тримати дух особового складу на високому рівні, допомагати військовослужбовцям у кризових ситуаціях, слідкувати за здоровою атмосферою у військовому колективі. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

психопрофілактична робота з особовим складом
психодіагностика
проведення психологічних консультацій та психокорекції з військовослужбовцями та членами їх родин
психологічна підтримка та допомога військовослужбовцям підрозділу.

Вимоги:

наявність освіти психолога
досвід роботи за фахом
володіння знаннями та практичними навичками в галузі
особиста психологічна стійкість.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення усім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування."""



poligraf = """Нам потрібні експерти, здатні правильно проводити співбесіди, з аналітичним складом розуму та уважністю до деталей — для фахового добору військовослужбовців та подальшої роботи з ними. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

проведення психологічного тестування
проведення службових розслідувань
аналіз вхідних даних
дотримання нормативних вимог
надання звітності та висновків за результатами тестувань.

Вимоги:

вік від 25 років
вища освіта за напрямками “Психологія” та/або “Правоохоронна діяльність”
досвід роботи в форматі “людина-людина”
досвід оперативної роботи в правоохоронних органах — перевага
комунікабельність
здібності до аналізу
стресостійкість
відповідальність
уважність до деталей.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення засобами індивідуального захисту та військовим майном
зарплатня від 100 тисяч гривень
навчання, постійні тренування
щорічна відпустка згідно з чинним законодавством України."""



smm = """Нам потрібні люди, які вміють вдало підбирати контент для різних соціальних мереж, розуміються на їх специфіці й можуть вдало просувати інформацію про підрозділ у мережі. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

ведення соціальних мереж підрозділу (YouTube, Facebook, Telegram, TikTok, Instagram тощо)
моніторинг соціальних мереж
виготовлення та/або адаптація контенту під конкретну соціальну мережу
архівація та збереження контенту
створення та ведення звітності.

Вимоги:

досвід роботи в SMM
навички створення та/або адаптації контенту під різні соціальні мережі
дотримання дедлайнів
володіння Adobe Photoshop, Adobe Illustrator, Adobe Premier Pro, Da Vinci Resolve, Corel Draw — перевага
вміння працювати з Google-Таблиці та Google-Документи — перевага

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом;
повне забезпечення усім необхідним;
зарплатня від 100 тисяч гривень;
навчання, постійні тренування."""



finance = """Нам потрібні люди, які розуміються в галузі бухгалтерського обліку та мають досвід роботи з фінансами. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

розрахунок грошового забезпечення, компенсацій, організація виплат військовослужбовцям
ведення фінансового обліку
формування фінансових розрахунків
подання заявок на кошти та оптимізацію їхнього використання
подання фінансових звітів
організація та контроль за обліком матеріально-технічних цінностей, участь у проведенні інвентаризації
проведення внутрішніх перевірок
ведення обліку документів.

Вимоги:

вища освіта в галузі “Облік та аудит”, “Фінанси” (або суміжні спеціальності)
знання всіх напрямків бухгалтерського обліку (господарські операції, кошти, взаєморахунки)
знання процедур внутрішнього контролю для забезпечення точності та надійності фінансової інформації
навички роботи з системами електронного документообігу та архівації документів
впевнене володіння Excel для аналізу даних, складання звітів та бюджетування
знання нормативно-правової бази (податкове законодавство, бухгалтерський облік)
досвід роботи бухгалтером — перевага

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення всім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування."""

buy = """Нам потрібні фахівці, здатні здійснювати необхідні для підрозділу закупівлі відповідно до норм чинного законодавства.Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

формування річного плану закупівель в електронній системі закупівель
вибір процедури закупівлі згідно з чинним законодавством
проведення закупівель з дотриманням чинного законодавства
складання, затвердження та зберігання закупівельної документації
оприлюднення відповідної інформації в електронній системі закупівель
взаємодія з органами, які здійснюють контроль в галузі публічних та оборонних закупівель
здійснення оборонних закупівель товарів, послуг та робіт.

Вимоги:

знання в галузі публічних та оборонних закупівель
вміння працювати в команді
здатність сприймати та обробляти великі обсяги інформації
вільне володіння комп’ютером
досвід роботи в галузі закупівель — перевага
освіта в галузі економіки або юриспруденції — перевага

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення всім необхідним
зарплатня від 100 тисяч гривень
навчання, постійні тренування."""


graphic = """Нам потрібні професіонали, здатні на основі брендбуку підрозділу розробляти графічну продукцію — як онлайн-графіку, так й макети для зовнішньої реклами. Вакансія передбачає мобілізацію або службу за контрактом у підрозділі безпілотних авіаційних систем FENIX. Залежно від навичок та бажання кандидата після співбесіди буде обрано конкретний напрямок його роботи.

Обов’язки:

створення шаблонів, обкладинок, графічних звітів, презентацій
створення графічних матеріалів для соціальних мереж
створення графічних рішень для зовнішньої реклами підрозділу
робота з фотоматеріалами підрозділу
вміння працювати з фотоапаратурою — перевага
робота з брендбуком підрозділу.

Вимоги:

досвід роботи графічним дизайнером
знання основ композиції, макетування, дизайну
володіння відповідним програмним забезпеченням (Adobe Photoshop, Adobe Illustrator, Corel Draw тощо)
вміння знаходити та реалізовувати творчі ідеї
дотримання дедлайнів.

Умови:

офіційна мобілізація до кінця воєнного стану або служба за контрактом
повне забезпечення засобами індивідуального захисту та військовим майном
зарплатня від 100 тисяч гривень
навчання, постійні тренування
щорічна відпустка згідно з чинним законодавством України."""